# Machine Learning Project

### Team Members: Mohamed Sidheeq M, Gunaseelan C, Monishwaran C

## Topic : Revenue Prediction of Ice Cream Sales based on the surrounding Temperature

Importing Libraries

In [1]:
import numpy as np 
import pandas as pd

Getting the Dataset

In [2]:
df=pd.read_csv('icecream.csv')

Performing data analysis operations

In [3]:
df.head()

   Temperature     Revenue
0    24.566884  534.799028
1    26.005191  625.190122
2    27.790554  660.632289
3    20.595335  487.706960
4    11.503498  316.240194

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Temperature  500 non-null    float64
 1   Revenue      500 non-null    float64
dtypes: float64(2)
memory usage: 7.9 KB

In [5]:
df.head(10)

   Temperature     Revenue
0    24.566884  534.799028
1    26.005191  625.190122
2    27.790554  660.632289
3    20.595335  487.706960
4    11.503498  316.240194
5    14.352514  367.940744
6    13.707780  308.894518
7    30.833985  696.716640
8     0.976870   55.390338
9    31.669465  737.800824

In [6]:
df.tail(10)

     Temperature     Revenue
490    23.824922  584.399945
491    34.472169  809.352519
492    23.056214  552.819351
493    14.931506  377.430928
494    25.112066  571.434257
495    22.274899  524.746364
496    32.893092  755.818399
497    12.588157  306.090719
498    22.362402  566.217304
499    28.957736  655.660388

In [7]:
df

     Temperature     Revenue
0      24.566884  534.799028
1      26.005191  625.190122
2      27.790554  660.632289
3      20.595335  487.706960
4      11.503498  316.240194
..           ...         ...
495    22.274899  524.746364
496    32.893092  755.818399
497    12.588157  306.090719
498    22.362402  566.217304
499    28.957736  655.660388

[500 rows x 2 columns]

Finding the dimension of the dataframe

In [8]:
df.ndim

2

Checking if there is any null value

In [9]:
df.isnull().sum()

Temperature    0
Revenue        0
dtype: int64

Finding the Shape of the dataframe

In [10]:
df.shape

(500, 2)

### Segregrating Dataset into X and Y

In [11]:
X=df['Temperature']

In [12]:
Y=df['Revenue']

Importing the necessary Libraries for Training

In [15]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler 
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score
import matplotlib.pyplot as plt
import seaborn as sns

### Splitting into Train & Test Data

In [16]:
X_train,X_test,Y_train,Y_test = train_test_split(X,Y,train_size=0.8)

Dimension of X_train

In [17]:
X.ndim

1

### Training the model

In [18]:
model = LinearRegression()

In [22]:
model.fit(np.array([X_train]).reshape(-1,1),Y_train)

LinearRegression()

In [23]:
Y_pred = model.predict(np.array([X_test]).reshape(-1,1))

### Finding the Accuracy

In [24]:
r2_score(Y_test,Y_pred)

0.9850516480386593

In [25]:
model.intercept_

44.69034380219756

In [26]:
model.coef_

array([21.42911737])

In [32]:
x = float(input("Enter The Temperature to predict the revenue?"))
y = 21.42911737*x + 44.69034380219756
print("The predicted revenue for the day is $", y)

Enter The Temperature to predict the revenue?30
The predicted revenue for the day is $ 687.5638649021976